import sys,time
import asyncio
#pylint: disable-msg=R6101
tasks_dependencies = {
    "Подготовка_окружения": {
        "этапы": [
            {"название": "Настройка виртуального окружения", "время": 1},
            {"название": "Установка базовых зависимостей", "время": 2},
            {"название": "Настройка системы контроля версий", "время": 3},
            {"название": "Проверка сетевых настроек", "время": 4},
            {"название": "Клонирование основной ветки", "время": 4},
            {"название": "Проверка последних изменений", "время": 6},
            {"название": "Проверка локальных зависимостей", "время": 8}
        ]
    },
    "Проверка_зависимостей": {
        "этапы": [
            {"название": "Обновление устаревших зависимостей", "время": 1},
            {"название": "Установка новых зависимостей", "время": 3},
            {"название": "Предварительная очистка", "время": 6},
            {"название": "Компиляция исходного кода ядра", "время": 4},
            {"название": "Логирование результатов компиляции", "время": 7}
        ]
    },
    "Компиляция_модулей": {
        "этапы": [
            {"название": "Компиляция модуля A", "время": 3},
            {"название": "Компиляция модуля B", "время": 4},
            {"название": "Тестирование модулей на совместимость", "время": 1},
            {"название": "Инициализация тестового окружения", "время": 3},
            {"название": "Тестирование модуля A", "время": 1}
        ]
    },
    "Сборка_БД": {
        "этапы": [
            {"название": "Создание структуры БД", "время": 2},
            {"название": "Наполнение начальными данными", "время": 6},
            {"название": "Импорт данных пользователей", "время": 2},
            {"название": "Импорт транзакционных данных", "время": 1},
            {"название": "Подготовка пакетов для релиза", "время": 4}
        ]
    },
    "Развертывание_релиза": {
        "этапы": [
            {"название": "Создание инструкций для установки", "время": 7},
            {"название": "Финальное тестирование релиза", "время": 1},
            {"название": "Развертывание сборки", "время": 4},
            {"название": "Проверка работоспособности сервисов", "время": 6},
            {"название": "Подготовка релизных заметок", "время": 6},
            {"название": "Финализация документации", "время": 4},
            {"название": "Размещение релиза на сервере обновлений", "время": 1},
            {"название": "Подготовка мероприятия", "время": 3},
            {"название": "Объявление об успешном релизе", "время": 4}
        ]
    }
}

async def execute_subtask(task_name, duration):
    if duration > 5:
        Delay = 5
        await asyncio.sleep(Delay)
        print(f'Подзадача: {task_name} не успела выполниться в срок, за {duration} сек.')
        return False
    #------------------------------------------------------------------------------------------
    Delay = duration
    await asyncio.sleep(Delay)
    print(f'Подзадача: {task_name} успела выполниться в срок, за {duration} сек.')
    return True

async def execute_task(task_name, subtasks):
    # print(subtasks)
    results = await asyncio.gather(*[execute_subtask(task["название"],task["время"]) for task in subtasks])
    # await asyncio.sleep(0)
    if all(results):
        print(f'Задача: {task_name} = все подзадачи выполнены')
    else:
        print(f'Задача: {task_name} не выполнилась в срок, т.к. одна или несколько подзадач заняли слишком много времени.')

async def main():
    for key,value in tasks_dependencies.items():
        await execute_task(key,value["этапы"])
        # await asyncio.sleep(0)
    # await asyncio.gather(*[execute_task(key,value["этапы"]) for key,value in tasks_dependencies.items()])
        # print('\n',key)
        # print(*value["этапы"],sep= '\n')


start_time = time.perf_counter()
# asyncio.run(send_requests())
asyncio.run(main())
stop_time = time.perf_counter()
Inetrval = stop_time - start_time
print(f'\nОбщее время выполнения {Inetrval:.7f}')
if not (len(sys.argv) > 1 and sys.argv[1] == 'cons'):input(':-> ')
sys.exit(0)
